projects/russian-transit/src/cfe/Русский_Транзит/DataProcessors/АРМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>АРМ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardBeginningDate</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбранныйДокументДляОтправки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоПоручительству</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КодыCMR</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>DocumentID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКодов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПТД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Декларация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатусТранзита</Name>
							<Type>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Перевозчик</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Декларант</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктОтправления</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктНазначения</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаНачалаТранзита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбеспечения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаОбеспечения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЭТД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОформления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомераCMR</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоCMR</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТаможниОтправления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГТД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Принципал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИННКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocumentID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КППКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТранспортныеСредства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПунктаОтправления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПунктаНазначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocumentID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПакетДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выбрать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Enums/ВидыДополнительныхОтчетовИОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыДополнительныхОтчетовИОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/DataProcessors/АРМ/Forms/ВыборРеестров/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	Если параметры.Свойство("Команда") тогда
		Действие = параметры.Команда;	
	КонецЕсли;	

	Если параметры.Свойство("Контрагент") тогда
		Объект.Контрагент = параметры.Контрагент;	
	КонецЕсли;
	
	НовСтрока = Объект.ПакетДокументов.Добавить();   
	НовСтрока.Значение = "Реестр оказанных услуг";
	НовСтрока = Объект.ПакетДокументов.Добавить();   
	НовСтрока.Значение = "Выработка декларантов";
	НовСтрока = Объект.ПакетДокументов.Добавить();   
	НовСтрока.Значение = "Просроченные транзиты";
	
	
	Если Параметры.Свойство("Данные") тогда
		ТЗ = ДанныеФормыВЗначение(ДокиНаОтправку, Тип("ТаблицаЗначений"));       
		Для каждого стр из Параметры.Данные цикл
			НовСтр = ДокиНаОтправку.Добавить();
			НовСтр.Документ = стр.ссылка; 
		КонецЦикла;	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	СформироватьИОтправитьНаСервере(); 
КонецПроцедуры

&НаСервере
Функция СформироватьИОтправитьНаСервере()  
	
	
	Для каждого стр из АдресаКлиента цикл   
		Если стр.Выбран = Истина тогда    
			
			ОтправлятьРеестр = Ложь;
			ОтправлятьВыработку = Ложь;
		
			Для каждого стр1 из Объект.ПакетДокументов цикл
				Если стр1.выбрать = Истина и стр1.значение = "Реестр оказанных услуг" тогда   
					ОтправлятьРеестр = Истина;
				ИначеЕсли стр1.выбрать = Истина и стр1.значение = "Выработка декларантов" тогда	
					ОтправлятьВыработку = Истина;
				КонецЕсли;	
			КонецЦикла;	  
			
			
			Если ОтправлятьРеестр = Истина тогда
				ТДРеестр = СформироватьПечатнуюФормуРеестрыНаСервере();
			КонецЕсли;
			
			Если ОтправлятьВыработку = истина тогда
				ТДДекларанты = СформироватьПечатнуюФормуДекларантыНаСервере();
			Конецесли;
			
			//формируем письмо и отправляем его
			ПисьмоОбъект = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
			ПисьмоОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
			ПисьмоОбъект.Важность = Перечисления.ВариантыВажностиВзаимодействия.Обычная;
			ПисьмоОбъект.Дата = ТекущаяДатаСеанса();
			ПисьмоОбъект.ЕстьВложения = Истина;
			ПисьмоОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			ПисьмоОбъект.ОтправительПредставление = УчетнаяЗапись.Наименование;
			ПисьмоОбъект.Текст = ПолеДляОтправки;
			
			Получатель = ПисьмоОбъект.ПолучателиПисьма.Добавить();
			Получатель.Адрес = Стр.АдресЭП;
			
			ПисьмоОбъект.СписокПолучателейПисьма = Стр.АдресЭП + ";";
			
			ПисьмоОбъект.СтатусПисьма = Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Исходящее;
			ПисьмоОбъект.Тема = "Пакетная отправка отчетов для " + Объект.Контрагент + " от " + ТекущаяДатаСеанса() + """Русский Транзит""" ;
			ПисьмоОбъект.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст;
			ПисьмоОбъект.УчетнаяЗапись = УчетнаяЗапись;
			ПисьмоОбъект.Записать();
			
			//вложения
			Если ОтправлятьРеестр = Истина тогда
				ИмяВременногоФайлаРеестр = ПолучитьИмяВременногоФайла("xlsx");      
				ТДРеестр.Записать(ИмяВременногоФайлаРеестр, ТипФайлаТабличногоДокумента.XLSX);  
				Файл1 = Новый Файл(ИмяВременногоФайлаРеестр);
				
				//создаем присоедиенный файл
				спр = Справочники.ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы.СоздатьЭлемент();
				спр.Автор 						= ПараметрыСеанса.ТекущийПользователь;
				спр.ВладелецФайла 				= ПисьмоОбъект.Ссылка;
				спр.ДатаСоздания 				= ТекущаяДатаСеанса();
				спр.ДатаМодификацииУниверсальная= ТекущаяДатаСеанса();
				спр.Изменил 					= ПараметрыСеанса.ТекущийПользователь;
				спр.Наименование 				= "Отчет РТ №1 от "+ ТекущаяДатаСеанса();
				спр.ПутьКФайлу 					= ИмяВременногоФайлаРеестр;
				спр.Размер 						= Файл1.Размер();
				спр.Расширение 					= "xlsx";
				спр.ТипХраненияФайла 			= Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе;
				спр.Записать();
				
				ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайлаРеестр);

				УстановитьПривилегированныйРежим(Истина);
				Попытка
					Запись = РегистрыСведений.УдалитьДвоичныеДанныеФайлов.СоздатьМенеджерЗаписи();
					Запись.Файл = спр.Ссылка;
					Запись.ДвоичныеДанныеФайла = Новый ХранилищеЗначения(ДвоичныеДанные);
					Запись.Записать(Истина);
					УстановитьПривилегированныйРежим(Ложь);
				Исключение
					УстановитьПривилегированныйРежим(Ложь);
					ВызватьИсключение;
				КонецПопытки;
			КонецЕсли;
			
			Если ОтправлятьВыработку = истина тогда
				ИмяВременногоФайлаАгент = ПолучитьИмяВременногоФайла("xlsx");      
				ТДДекларанты.Записать(ИмяВременногоФайлаАгент, ТипФайлаТабличногоДокумента.XLSX);
				Файл2 = Новый Файл(ИмяВременногоФайлаАгент);   
				
				
				спр = Справочники.ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы.СоздатьЭлемент();
				спр.Автор 						= ПараметрыСеанса.ТекущийПользователь;
				спр.ВладелецФайла 				= ПисьмоОбъект.Ссылка;
				спр.ДатаСоздания 				= ТекущаяДатаСеанса();
				спр.ДатаМодификацииУниверсальная= ТекущаяДатаСеанса();
				спр.Изменил 					= ПараметрыСеанса.ТекущийПользователь;
				спр.Наименование 				= "Отчет Агента №1 от " + ТекущаяДатаСеанса();
				спр.ПутьКФайлу 					= ИмяВременногоФайлаАгент;
				спр.Размер 						= Файл2.Размер();
				спр.Расширение 					= "xlsx";
				спр.ТипХраненияФайла 			= Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе;
				спр.Записать(); 
				ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайлаАгент);

				УстановитьПривилегированныйРежим(Истина);
				Попытка
					Запись = РегистрыСведений.УдалитьДвоичныеДанныеФайлов.СоздатьМенеджерЗаписи();
					Запись.Файл = спр.Ссылка;
					Запись.ДвоичныеДанныеФайла = Новый ХранилищеЗначения(ДвоичныеДанные);
					Запись.Записать(Истина);
					УстановитьПривилегированныйРежим(Ложь);
				Исключение
					УстановитьПривилегированныйРежим(Ложь);
					ВызватьИсключение;
				КонецПопытки;
			КонецЕсли;
			
			ПараметрыПисьма = Взаимодействия.ПараметрыПисьмаДляОтправки(ПисьмоОбъект);
			Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(ПисьмоОбъект.УчетнаяЗапись, ПараметрыПисьма);
			РезультатОтправки = РаботаСПочтовымиСообщениями.ОтправитьПисьмо(ПисьмоОбъект.УчетнаяЗапись, Письмо);   
			
		КонецЕсли;
	КонецЦикла;
КонецФункции  


&НаСервере
Функция ПолучитьПараметрыКомандыВнешнегоОтчета(Ссылка)
    Запрос = новый Запрос;
    Запрос.УстановитьПараметр("Ссылка",Ссылка);
    Запрос.Текст =
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   ТаблицаКоманды.Ссылка,
    |   ТаблицаКоманды.Идентификатор,
    |   ТаблицаКоманды.ВариантЗапуска,
    |   ТаблицаКоманды.Представление КАК Представление,
    |   ТаблицаКоманды.ПоказыватьОповещение,
    |   ТаблицаКоманды.Модификатор
    |ИЗ
    |   Справочник.ДополнительныеОтчетыИОбработки.Команды КАК ТаблицаКоманды
    |ГДЕ
    |   ТаблицаКоманды.Скрыть = ЛОЖЬ
    |   И ТаблицаКоманды.Ссылка = &Ссылка
    |
    |УПОРЯДОЧИТЬ ПО
    |   Представление";

    Результат = Запрос.Выполнить().Выбрать();

    Если Результат.Количество() = 0 Тогда
        возврат Неопределено;
    Иначе
        Результат.Следующий();
        ВыполняемаяКоманда = Новый Структура(
        "Ссылка, Представление,
        |Идентификатор, ВариантЗапуска, ПоказыватьОповещение,
        |Модификатор, ОбъектыНазначения, ЭтоОтчет, Вид");

        ЗаполнитьЗначенияСвойств(ВыполняемаяКоманда,Результат);

        Возврат ВыполняемаяКоманда;
    КонецЕсли;
КонецФункции


//Внешний отчет
&НаСервере
Функция СформироватьПечатнуюФормуРеестрыНаСервере() 
	
	ТабДок = новый ТабличныйДокумент;
	
	ОтчетДекларанты = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Реестр оказанных услуг");
	ВидОтчета = Перечисления.ВидыДополнительныхОтчетовИОбработок.Отчет;	   
	
	ВыполняемаяКоманда = ПолучитьПараметрыКомандыВнешнегоОтчета(ОтчетДекларанты);
	
	ВыполняемаяКоманда.ЭтоОтчет = Истина;
	ВыполняемаяКоманда.Вид      = ВидОтчета;
	
	ПараметрыОбработки = Новый Структура("ИдентификаторКоманды, ДополнительнаяОбработкаСсылка, ИмяФормы, КлючСессии, ПользовательскиеНастройки, СформироватьПриОткрытии");
	ПараметрыОбработки.ИдентификаторКоманды          = ВыполняемаяКоманда.Идентификатор;
	ПараметрыОбработки.ДополнительнаяОбработкаСсылка = ВыполняемаяКоманда.Ссылка;
	ПараметрыОбработки.ИмяФормы                      = Неопределено;
	ПараметрыОбработки.КлючСессии                    = ВыполняемаяКоманда.Ссылка.УникальныйИдентификатор();
	ПараметрыОбработки.СформироватьПриОткрытии       = Истина;          
	
	ИмяФайла = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВыполняемаяКоманда.Ссылка);
	
	ОбработкаОбъект = ВнешниеОтчеты.Создать(ИмяФайла);  
	
	МассивДокументов = новый Массив();
	Для каждого стр из ДокиНаОтправку цикл
		МассивДокументов.Добавить(стр.Документ);
	КонецЦикла;   
		
	КомпоновщикНастроекКомпоновкиДанных = ОбработкаОбъект.КомпоновщикНастроек;
	ПользовательскиеНастройки = КомпоновщикНастроекКомпоновкиДанных.ПользовательскиеНастройки;       
	
	ОтборКонтрагент =  ПолучитьОтборПользовательскойНастройки(КомпоновщикНастроекКомпоновкиДанных, ПользовательскиеНастройки, "ссылка");   
	Если ОтборКонтрагент <> Неопределено тогда
		ОтборКонтрагент.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборКонтрагент.ПравоеЗначение = Объект.Контрагент;
		ОтборКонтрагент.Использование  = Истина;     
	КонецЕсли;   
	
	ОтборДоговор = ПолучитьОтборПользовательскойНастройки(КомпоновщикНастроекКомпоновкиДанных, ПользовательскиеНастройки, "Договор");
	Если ОтборДоговор <> Неопределено тогда
		ОтборДоговор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборДоговор.Использование  = ложь;     
	КонецЕсли;   
	
	ОтборСтатус = ПолучитьОтборПользовательскойНастройки(КомпоновщикНастроекКомпоновкиДанных, ПользовательскиеНастройки, "Статус");
	Если ОтборСтатус <> Неопределено тогда
		ОтборСтатус.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборСтатус.Использование  = ложь;     
	КонецЕсли;  
	
	Поле = новый ПолеКомпоновкиДанных("Документ");

	ОтборДоки = КомпоновщикНастроекКомпоновкиДанных.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборДоки.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборДоки.Использование  = Истина;     
	ОтборДоки.ПравоеЗначение = МассивДокументов;
	ОтборДоки.ЛевоеЗначение = Поле;
	
	ПараметрыОбработки.ПользовательскиеНастройки = ПользовательскиеНастройки;   
	
	ОбработкаОбъект.СкомпоноватьРезультат(ТабДок); 
	
	имя = ПолучитьИмяВременногоФайла("xlsx");
	ТабДок.Записать(Имя, ТипФайлаТабличногоДокумента.XLSX);  
	
	Возврат ТабДок;
	
КонецФункции   


&НаСервере
Функция ПолучитьОтборПользовательскойНастройки(Компоновщик, ПользовательскиеНастройки, ИмяПоля)
    Поле = новый ПолеКомпоновкиДанных(ИмяПоля);

    ИдентификаторОтбора = Неопределено;
    Для Каждого Элемент из Компоновщик.Настройки.Отбор.Элементы Цикл
        Если Элемент.ЛевоеЗначение = Поле Тогда
            ИдентификаторОтбора = Элемент.ИдентификаторПользовательскойНастройки;
        КонецЕсли;
    КонецЦикла;

    возврат ПользовательскиеНастройки.Элементы.Найти(ИдентификаторОтбора);
КонецФункции

&НаКлиенте
Процедура УстановитьПараметрПользовательскойНастройки(ПользовательскиеНастройки, ИмяНастройки, Параметр)

    ПолеКомпановкиПараметр = Новый ПараметрКомпоновкиДанных(ИмяНастройки);
    ЭлементОтбора = Неопределено;

    Для Каждого Элемент Из ПользовательскиеНастройки.Элементы Цикл
        Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") и Элемент.Параметр = ПолеКомпановкиПараметр Тогда
            Элемент.Значение = Параметр.Значение;
            Элемент.Использование = Истина;
            Прервать;
        КонецЕсли;
    КонецЦикла;

КонецПроцедуры

 &НаСервере
Функция СформироватьПечатнуюФормуДекларантыНаСервере()  
	
	ТабДок = новый ТабличныйДокумент;
	
	ОтчетРеестр = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Выработка декларантов");   
	Если НЕ ЗначениеЗаполнено(ОтчетРеестр) Тогда
		Возврат Ложь;
	КонецЕсли;
	ВидОтчета = Перечисления.ВидыДополнительныхОтчетовИОбработок.Отчет;	 
	
	ВыполняемаяКоманда = ПолучитьПараметрыКомандыВнешнегоОтчета(ОтчетРеестр);
	//Теперь заполним недостающие поля команды:
	
	ВыполняемаяКоманда.ЭтоОтчет = Истина;
	ВыполняемаяКоманда.Вид      = ВидОтчета;
	//Создадим структуру с параметрами запуска нашего отчета:
	
	ПараметрыОбработки = Новый Структура("ИдентификаторКоманды, ДополнительнаяОбработкаСсылка, ИмяФормы, КлючСессии, ПользовательскиеНастройки, СформироватьПриОткрытии");
	ПараметрыОбработки.ИдентификаторКоманды          = ВыполняемаяКоманда.Идентификатор;
	ПараметрыОбработки.ДополнительнаяОбработкаСсылка = ВыполняемаяКоманда.Ссылка;
	ПараметрыОбработки.ИмяФормы                      = Неопределено;
	ПараметрыОбработки.КлючСессии                    = ВыполняемаяКоманда.Ссылка.УникальныйИдентификатор();
	ПараметрыОбработки.СформироватьПриОткрытии       = Истина;          
	
	ИмяФайла = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВыполняемаяКоманда.Ссылка);
	
	ОбработкаОбъект = ВнешниеОтчеты.Создать(ИмяФайла);  
	
	МассивДокументов = новый Массив();
	Для каждого стр из ДокиНаОтправку цикл
		МассивДокументов.Добавить(стр.Документ);
	КонецЦикла;   
		
	//Форма = ПолучитьФорму("ВнешнийОтчет."+ ИмяОбработки_ +".Форма");
	//КомпоновщикНастроекКомпоновкиДанных = Форма.Отчет.КомпоновщикНастроек;
	КомпоновщикНастроекКомпоновкиДанных = ОбработкаОбъект.КомпоновщикНастроек;
	ПользовательскиеНастройки = КомпоновщикНастроекКомпоновкиДанных.ПользовательскиеНастройки;       
	
	
	// Отбор по документам
	ОтборДокументы = КомпоновщикНастроекКомпоновкиДанных.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ПолеОтбора = новый ПолеКомпоновкиДанных("Ссылка");  
	
	ОтборДокументы.ЛевоеЗначение = ПолеОтбора;
	ОтборДокументы.Использование = Истина;
	ОтборДокументы.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборДокументы.ПравоеЗначение = МассивДокументов;    
	
	// Отбор по декларанту     
	ОтборДекларант = КомпоновщикНастроекКомпоновкиДанных.Настройки.Отбор.Элементы.Получить(0);     
	
	ПараметрыОбработки.ПользовательскиеНастройки = ПользовательскиеНастройки;   
	
	ОбработкаОбъект.СкомпоноватьРезультат(ТабДок); 
	
	имя = ПолучитьИмяВременногоФайла("xlsx");
	ТабДок.Записать(Имя, ТипФайлаТабличногоДокумента.XLSX);  
	
	Возврат ТабДок;
	
КонецФункции  

&НаКлиенте
Процедура КомандаПродолжить(Команда) 

	Если Объект.ПакетДокументов.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не сформирован пакет документов для отправки.");
		Возврат;
	КонецЕсли;
	
	// Доработка {L-3 2026-05-20}: вместо магических чисел 1/2/3 - строковые ключи отчётов.
	Массив = Новый Массив;
	Для Каждого Стр Из Объект.ПакетДокументов Цикл
		Если НЕ Стр.выбрать Тогда
			Продолжить;
		КонецЕсли;
		Если Стр.значение = "Реестр оказанных услуг" Тогда
			Массив.Добавить("Реестр");
		ИначеЕсли Стр.значение = "Выработка декларантов" Тогда
			Массив.Добавить("Декларанты");
		ИначеЕсли Стр.значение = "Просроченные транзиты" Тогда
			Массив.Добавить("Просрочка");
		КонецЕсли;
	КонецЦикла;

	Если Действие = "Сохранить" Тогда
		СохранитьФайлы(Массив);
	ИначеЕсли Действие = "Отправить" Тогда
		ЗаполнитьЭПКлиентаНасервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЭПКлиентаНасервере()  
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страница2;    
	
	Запрос = новый запрос; 
	Запрос.УстановитьПараметр("Ссылка", Объект.Контрагент);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтрагентыКонтактнаяИнформация.АдресЭП КАК АдресЭП
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка = &Ссылка";
	
	Результат = запрос.Выполнить();
	выборка = результат.Выбрать();
	
	Пока Выборка.Следующий() цикл
		НовСтрока = АдресаКлиента.Добавить();
		НовСтрока.АдресЭП = выборка.АдресЭП;
	КонецЦикла;
	
	Если АдресаКлиента.Количество() = 0 тогда
		Для каждого стр из ДокиНаОтправку цикл
		НовСтрока = АдресаКлиента.Добавить();
		НовСтрока.АдресЭП = стр.ЭлПочта;
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры	
	
&НаКлиенте
Процедура АдресаКлиентаПриИзменении(Элемент)
	Если НЕ АдресаКлиента.Количество() = 0 тогда
		Элементы.Отправить.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлы(ПакетДокументов)

	ПутьКФайлу = "";

	Если ПакетДокументов.Найти("Реестр") <> Неопределено Тогда
		ТДРеестр = СформироватьПечатнуюФормуРеестрыНаСервере();
	КонецЕсли;

	Если ПакетДокументов.Найти("Декларанты") <> Неопределено Тогда
		ТДДекларанты = СформироватьПечатнуюФормуДекларантыНаСервере();
	КонецЕсли;

	Попытка
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		ДиалогОткрытияФайла.ПолноеИмяФайла = ПутьКФайлу;
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок = "Выберите каталог для сохранения отчётов";
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			ПутьКФайлу = ДиалогОткрытияФайла.Каталог;
		Иначе
			Возврат;
		КонецЕсли;

		Если ПакетДокументов.Найти("Реестр") <> Неопределено Тогда
			ТДРеестр.Записать(ПутьКФайлу + "\РОУ " + Объект.Контрагент
				+ " " + Формат(ТекущаяДатаСеанса(), "ДЛФ=Д") + ".xlsx",
				ТипФайлаТабличногоДокумента.XLSX);
		КонецЕсли;
		Если ПакетДокументов.Найти("Декларанты") <> Неопределено Тогда
			ТДДекларанты.Записать(ПутьКФайлу + "\ОПД " + Объект.Контрагент
				+ " " + Формат(ТекущаяДатаСеанса(), "ДЛФ=Д") + ".xlsx",
				ТипФайлаТабличногоДокумента.XLSX);
		КонецЕсли;

		ПоказатьПредупреждение(, "Файлы сохранены на диск.");
	Исключение
		ЗаписьЖурналаРегистрации("АРМ.ВыборРеестров.СохранитьФайлы",
			УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
		ПоказатьПредупреждение(, "Не удалось записать файлы: " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры
